app/controllers/chapters_controller.rb

  def index
    chapters = Chapter.all
---
SELECT "chapters".* FROM "chapters"

  def show
    chapter = Chapter.find_by_id(params[:id])
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]

    def set_chapter
      @chapter = Chapter.find(params[:id])
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]