app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages"
---
  def index
    pages = Page.all